华为DFX设计平台即面向产品生命周期各/某环节的设计。此项目基于springMVC框架开发，运用Nginx、Redis、Dubbo 、 ActiveMQ等技术配合SpringMvc完成开发。项目涉及功能：
后台系统管理：系统管理员拥有最大权限，可对其它用户进行授权，配置元数据，id 生成器等功能；
前台系统首页：用户可以在首页进行全局搜索，我的待办任务，我的网上问题，我的项目等操作；
单点登录系统：为系统提供用户登录凭证以及查询登录用户的信息，一处登录，其它地方免登录；
全局搜索模块：用户可在首页进行关键字搜索，可查询项目文档，项目任务，文档库，交付件等；
网上问题分析：主要分为网上问题导入、跟踪、分析三部分，用户可通过Excel 导入，下发，分配分
析责任人，问题分为待下发，待分析，已分析，已关闭等状态；
网络子产品线：用户可新增需求，需求要配置产品版本，产品责任人，可关联能力目标，能力目标可
关联能力目标等级；
组件库模块：用户可下载，更新组件库；
知识库模块: 有共享文档库，项目文档，可上传文档，word 等，可打标签，支持标签搜索，过滤；
技术要点：
项目使用maven 聚合工程管理项目，采用主流的SSM 框架进行开发，数据库采用mysql；
 项目是基于dubbo 的微服务框架，使用zookeeper 作为注册中心，管理服务提供者，服务消
费者，使用nginx 实现服务的负载均衡；
 使用Git 进行代码管理，SVN 进行资料共享；
 使用flyway 对数据库的版本进行管理，使用yaml 脚本管理微服务接口，model 定义实体类；
 使用ActiveMQ 发送异步消息处理，加速页面上的响应，如项目关闭需要将项目下的任务、任
务进展、任务回复等信息进行删除，这些操作涉及到了大量的外部服务调用，直接删除将会消耗
大量时间，导致页面响应速度过慢甚至超时，这样会影响到用户体验。通过ActiveMQ 删除一
些基本的项目表后，发送异步消息去删除其它项目下的关联信息，然后就可以返回了。
 使用redis 缓存技术，将一些常用的数据加载到redis 缓存中，用时直接从缓存上取，而不需要
重新查询数据库，减少对数据库的访问压力，这里主要作为内存容器来使用。
 使用Vue 框架，路由，接口的定义均使用resful 风格，请求使用ajax 异步请求，加快开发效率。
 索引库采用ElasticSearch,建立索引，大大加快了全局搜索查询速度。
个人职责：
   参与方案评审，story串讲反串讲，及时发现方案所出现的问题和遗漏，将问题暴露在开发之前。
   编写todoList和验收标准，将本次任务所需要完成的内容及流程在开发之前输出，方便本次开发。验收标准则为本次任务设置完成目标和方便与测试沟通。
   底层数据表、库的创建和本次需求的增删改查接口。
   业务逻辑的实现及补充，完成迭代新需求和功能的业务逻辑和改进需求业务逻辑的完善。
   前端的页面展示及前后台数据拉通。
   修改service的不规范编程，修改代码指标使其达到规范标准。
   代码检视，发现代码不足和缺陷。
   安全问题排查，按照安全隐患关键字等进行安全排查并修改安全问题。
